{
  "header": {
    "name": "Suah Bae",
    "jobTitle": "Backend Developer",
    "contact": {
      "tel": {
        "text": "(+82)10-5699-0138",
        "href": "tel:+821056990138"
      },
      "email": {
        "text": "bsa0530@gmail.com",
        "href": "mailto:bsa0530@gmail.com"
      },
      "github": {
        "id": "su8y",
        "href": "https://github.com/su8y"
      },
      "blog": {
        "text": "Blog",
        "href": "https://suby.tistory.com/"
      }
    }
  },
  "summary": {
    "paragraphs": [
      "A 2-year experienced **Backend Developer** focused on continuous learning, growth, and demonstrating strong leadership capabilities.",
      "Beyond merely writing code, I utilize principles of **Object-Oriented Design** to architect and build flexible, scalable systems with future maintainability and extensibility in mind.",
      "**I thrive in highly concurrent and non-blocking development environments.** To establish an efficient development pipeline, I successfully spearheaded the adoption of a structured development process, enhancing system stability and automating resource-intensive deployment tasks, thereby **leading** the improvement of the in-house development culture.",
      "**Driven by the belief that 'if you want to go fast, go alone; if you want to go far, go together,'** I champion the continuous growth of the entire team. I focus on achieving sustainable code through comprehensive testing, clear design documentation, and thorough code reviews, ensuring that the entire team can understand and contribute. I believe this collaborative approach is the most effective way to enhance both team productivity and service quality.",
      "Leveraging a **quick learning ability in new domains**, I have expanded my experience beyond backend development to include frontend and AI/ML fields. I have demonstrated adaptability by training CNN models and optimizing model serving APIs to achieve a **180% increase in TPS**."
    ]
  },
  "experiences": [
    {
      "name": "JBT Crop @ Core Development Team",
      "role": "Backend-Developer",
      "period": "Jan 2024 ~ Present"
    },
    {
      "name": "System Monitoring Agent Development",
      "period": "Jan 2025 ~ Present",
      "role": "Part Leader",
      "background": [
        "In an environment where numerous processes on 16 distributed servers across 4 data centers operate organically, faults were often recognized only through 'customer inquiries,' leading to excessive time spent on root cause analysis.",
        "There was a critical need to optimize the time spent monitoring 'why,' 'how,' and 'for how long' a problem persisted."
      ],
      "content": [
        "**Fault Management:** Real-time detection of abnormal events, including service interruption, hardware failure, network disconnection, and application errors.",
        "**Failover:** Developed a system for reloading core processes upon error or termination to ensure continuity.",
        "**Critical Property Management:** Developed an agent to monitor and detect mismatches in mission-critical properties and configuration files."
      ],
      "result": [
        "Achieved **99.9% uptime** for servers handling **6000+ tps** from 300,000 users.",
        "Reduced service interruption and incident alarm failures to **less than 5%** (critical network alarms still represent a known area for improvement)."
      ],
      "images": [
        "assets/images/project-3/architecture.png"
      ]
    },
    {
      "name": "Internal Development Process Automation",
      "role": "Leader",
      "period": "May 2024 ~ Present",
      "background": [
        "Recurring issues such as frequent deployment failures and errors, slow development cycles, repetitive manual deployment tasks, technical debt, and workflow bottlenecks."
      ],
      "content": [
        "Researched team-level development methodologies within the company.",
        "Analyzed bottlenecks in the existing manual deployment process and collected improvement requirements through interviews with fellow developers.",
        "Designed and implemented a CI/CD pipeline architecture using GitLab Native (GitLab Runner, GitLab Image Registry, k8s) based on the company's existing GitLab environment."
      ],
      "result": [
        "Deployment time reduced by **30%**, and a periodic deployment environment was successfully established.",
        "Achieved **50% test coverage**.",
        "Continuously received positive feedback from colleagues regarding increased work efficiency.",
        "[Retrospective Blog Post](https://suby.tistory.com/entry/CICD%EB%B9%84%ED%9A%A8%EC%9C%A8%EC%9D%98%EA%B5%B4%EB%A0%80%EB%A5%BC%EB%81%8A%EC%96%B4%EB%82%B4%EB%8A%94-%EC%97%AC%EC%A0%95)"
      ],
      "images": [
        "assets/images/project-2/architecture.png"
      ]
    },
    {
      "name": "Next-Generation Geospatial Data Management Web Application Development",
      "role": "Full-stack Developer",
      "period": "Jan 2024 ~ June 2024",
      "background": [
        "Need for real-time access for multiple users in the existing client-server (CS) geospatial data editing tool.",
        "Increased necessity for organic, real-time interaction events (CRUD, Merge, Split, etc.) between geospatial features via a web-based migration."
      ],
      "content": [
        "Designed and developed data models and APIs for geospatial feature editing and real-time collaboration.",
        "Implemented a **Lock Mechanism** to resolve data inconsistency issues during real-time collaboration.",
        "Developed a user-interactive map UI using **React.js** to manage feature states and build user-interactive pages."
      ],
      "images": [
        "assets/images/project-1/architecture.png"
      ]
    }
  ],
  "other-experiences": [
    {
      "name": "LensPay Development",
      "role": "Planning, Design, Backend (Part Leader)",
      "period": "Sep 2025 ~ Present",
      "content": [
        "Service development, deployment, and maintenance.",
        "[Information Site](http://introduce.lenspay.site)"
      ]
    },
    {
      "name": "Apache Gravitino OpenSource Contributor",
      "role": "Contributor",
      "period": "Jul 2025 ~ Present",
      "content": [
        "Improved test code for the Apache Gravitino CLI module.",
        "[Blog Post on WET vs DRY](https://suby.tistory.com/entry/WET-vs-DRYfeat-%EC%98%A4%ED%94%88%EC%86%8C%EC%8A%A4%EA%B8%B0%EC%97%AC)"
      ]
    },
    {
      "name": "CNN-based Forest Fire Monitoring",
      "role": "Solo Developer",
      "period": "June 2025 ~ July 2025",
      "content": [
        "Data labeling and preparation.",
        "CNN model training and research.",
        "Optimized the API serving server to achieve a **180% increase in TPS** compared to the baseline model.",
        "[Project GitHub](https://github.com/su8y/yolov8-fire-smoke-detection)"
      ]
    },
    {
      "name": "Algorithm Study Group",
      "role": "Study Leader",
      "period": "Aug 2022 ~ Jan 2024",
      "content": [
        "Operated online/offline study groups to expose members to diverse algorithm problems and share problem-solving perspectives.",
        "Led 4 weeks of online studies, resulting in a total of 500+ problem completions and reviews.",
        "[Project GitHub](https://github.com/su8y/yolov8-fire-smoke-detection)"
      ]
    }
  ],
  "skills": [
    {
      "name": "Java & Spring",
      "description": "I have a deep understanding of Object-Oriented Design principles, implementing flexible and scalable architectures, and building robust, testable systems based on **TDD** (Test-Driven Development)."
    },
    {
      "name": "Typescript & React.js",
      "description": "Built user interfaces (UI) for GIS map applications, demonstrating proficiency in component-based development and state management to construct dynamic UIs."
    },
    {
      "name": "C/C++",
      "description": [
        "Contributed to the development of a system monitoring agent for a system valued over 10 billion KRW (approx. 7.3 million USD), focusing on stable logic implementation.",
        "Specifically, provided support for careful design in resource-constrained environments and built a **Failover** mechanism to ensure service continuity during failures."
      ]
    },
    {
      "name": "Python & Pytorch",
      "description": [
        "Capable of rapid prototyping for problem-solving.",
        "Experienced in research and optimization of CNN-based forest fire monitoring models, utilizing these skills for the development, training, and evaluation of machine learning models, and independently driving **PoC** (Proof of Concept) development for ML model serving."
      ]
    },
    {
      "name": "PostgresSql",
      "description": "Deeply understand the core principles of relational databases, utilizing this knowledge for effective data modeling and efficient query writing."
    },
    {
      "name": "Docker & Kubernetes",
      "description": "As part of the [Journey to End Inefficiency] project, I utilize these technologies, integrated with a CI/CD pipeline, to automate building, testing, and deployment, thereby improving development productivity and contributing to quality enhancement through effective test environment setup."
    }
  ],
  "educations": [
    {
      "name": "Bachelor's Degree in Computer Science (Credit Bank System)",
      "period": "Sep 2025 ~ Feb 2026 (Expected Graduation)"
    },
    {
      "name": "Kyungmin University, Associate's Degree in Software Engineering (3-year program, Graduated)",
      "period": "Mar 2019 ~ Feb 2024"
    },
    {
      "name": "Engineer Information Processing (Certified)",
      "period": "Sep 2025 ~ Present"
    }
  ]
}