{
  "header": {
    "name": "Sua Bae",
    "jobTitle": "Backend Developer",
    "contact": {
      "tel": {
        "text": "(+82)10-5699-0138",
        "href": "tel:+821056990138"
      },
      "email": {
        "text": "bsa0530@gmail.com",
        "href": "mailto:bsa0530@gmail.com"
      },
      "github": {
        "id": "su8y",
        "href": "https://github.com/su8y"
      },
      "blog": {
        "text": "Blog",
        "href": "https://suby.tistory.com/"
      }
    }
  },
  "hello": [
    "Hello,",
    "I am Sua Bae, a Backend Developer who actively seeks out challenges and enjoys the problem-solving process.",
    "I strongly believe in the motto, 'If you want to go far, go together.'"
  ],
  "summary": {
    "paragraphs": [
      "I am passionate about development because I find great appeal in the process of [accurately defining problems, grasping their essence, and crafting solutions](https://github.com/su8y/Algorithm#).",
      "When learning new technologies, I prioritize understanding 'What' it is and 'Why' it emerged—its background and purpose—over merely 'How' to use it.",
      "I believe that understanding the philosophy and necessity behind a technology is essential for making the right choices and applying it correctly."
    ]
  },
  "experiences": [
    {
      "name": "JBT Crop · Core Development Team",
      "role": "Backend Developer",
      "period": "Jan 2024 ~ Present"
    },
    {
      "name": "Development of Integrated System Monitoring (OAM) Daemon",
      "period": "Jan 2025 ~ Present",
      "role": "Part Leader",
      "background": [
        "In a distributed environment with 16 servers across 4 data centers, system failures were often discovered late through customer inquiries.",
        "It took excessive time to identify the cause, method, and duration of failures, leading to a decline in service reliability.",
        "A key challenge was establishing a stable event delivery system that prevents data loss even during network outages.",
        "The goal was to drastically reduce Mean Time To Detect (MTTD) and Mean Time To Repair (MTTR)."
      ],
      "content": [
        "Designed a mutual surveillance architecture: Implemented a cross-VM Health Check structure to achieve immediate failure detection without Single Points of Failure (SPOF).",
        "Built a Failover System: Designed automatic reloading upon detecting critical process errors, significantly improving MTTR.",
        "Developed an Integrity Monitoring Agent: Prevented deployment-related failures by detecting real-time changes and mismatches in core configuration files (Properties).",
        "Identified event loss issues during network disconnects and introduced an Event Queue (Failed Query) mechanism to queue failed events and automatically retransmit them upon recovery."
      ],
      "result": [
        "Achieved 99.9% availability in a server environment processing 6,000+ TPS with 300,000 users.",
        "Maintained an event delivery failure rate of under 5% even in unstable network environments."
      ],
      "images": [
        "assets/images/project-3/architecture.png",
        "assets/images/project-3/module.png"
      ]
    },
    {
      "name": "Wildfire Monitoring PoC using CNN Models",
      "period": "Jun 2025 ~ Jul 2025",
      "role": "Planning, Design, Development",
      "background": [
        "Aimed to validate the concept (PoC) of CNN-based (YOLOv8, MobileNet, etc.) wildfire detection models and evaluate feasibility for actual service.",
        "Started the project as a new technical challenge with no prior domain experience in CNNs."
      ],
      "content": [
        "Prioritized acquiring minimum viable knowledge to request mentoring from AI experts.",
        "Learned the entire process of CNN model implementation and serving within a short period through active mentoring and research.",
        "Improved accuracy to over 70% by repeating model comparison and hyperparameter tuning to solve detection performance issues.",
        "Researched various architectures to address serving API TPS issues, ultimately improving TPS by over 180% through structural optimization."
      ],
      "result": [
        "Repository: https://github.com/su8y/yolov8-fire-smoke-detection",
        "Tech Stack: Python, PyTorch, YOLOv8"
      ],
      "images": [
        "assets/images/fire-detection/poc.png"
      ]
    },
    {
      "name": "Establishment of CI/CD Pipeline",
      "role": "Leader",
      "period": "May 2024 ~ Present",
      "background": [
        "The goal was to resolve structural inefficiencies across the development process, such as frequent deployment failures, repetitive manual work, and slowdowns due to technical debt."
      ],
      "content": [
        "Analyzed team-level development processes and collected improvement requirements through colleague interviews prior to adoption.",
        "Designed and built a GitLab Native CI/CD pipeline based on GitLab Runner, GitLab Image Registry, and Kubernetes.",
        "Automated the Build-Test-Deploy process and improved development efficiency by establishing test environments and defining development conventions."
      ],
      "result": [
        "Led the improvement of in-house development productivity.",
        "Reduced deployment time by 30% and established a periodic, stable deployment system.",
        "Achieved 50% test coverage.",
        "Peer Feedback: 'Adapting wasn't difficult, and work efficiency has increased significantly.'",
        "Blog Post: https://suby.tistory.com/entry/CICD비효율의굴레를끊어내는-여정"
      ],
      "images": [
        "assets/images/project-2/architecture.png"
      ]
    },
    {
      "name": "Development of IAM (Identity and Access Management) System & Back-office",
      "role": "Auth Part Lead",
      "period": "Aug 2025 ~ Present",
      "background": [
        "Built an Identity microservice and a management back-office (Web UI + API) to integratedly manage accounts and permissions for various distributed services."
      ],
      "content": [
        "Developed core authentication/authorization functions based on Spring Security (Login, Token issuance/refresh, Session/Token management).",
        "Designed a dynamic authorization process and hierarchical permission model; built an RBAC (Role-Based Access Control) system.",
        "Established systems for user lifecycle management, permission assignment, and logging of access & system errors."
      ],
      "images": [
      ]
    }
  ],
  "other-experiences": [
    {
      "name": "Open Source Contributions",
      "role": "Contributor",
      "period": "Jul 2025 ~ Present",
      "content": [
        "**[apache/gravitino](https://github.com/apache/gravitino) (4 Features)**<br/>",
        "Correct URL encode path in `alterModelVersion` in `GenericModelCatalog.java` [#7694](https://github.com/apache/gravitino/pull/7694)",
        "Missing `@Override` annotation to the `hashCode` method of `SparkJobTemplate` [#7653](https://github.com/apache/gravitino/pull/7653)",
        "Remove duplicate owner in CLI [#7651](https://github.com/apache/gravitino/pull/7651)",
        "Add error handling and absolute path resolution in gcli.sh [#7620](https://github.com/apache/gravitino/pull/7620)"
      ],
      "result": [
        "[Blog Post: WET vs DRY (feat. Open Source Contribution)](https://suby.tistory.com/entry/WET-vs-DRYfeat-%EC%98%A4%ED%94%88%EC%86%8C%EC%8A%A4%EA%B8%B0%EC%97%AC)"
      ]
    },
    {
      "name": "LensPay Development",
      "role": "Planning, Design, Backend (Part Leader)",
      "period": "Sep 2025 ~ Present",
      "content": [
        "Service development, deployment, and maintenance tasks.",
        "[Introduction Site](http://introduce.lenspay.site)"
      ]
    },
    {
      "name": "Algorithm Study",
      "role": "Study Leader",
      "period": "Aug 2022 ~ Jan 2024",
      "content": [
        "Operated on/offline study groups to share problem-solving approaches for various algorithm problems.",
        "Conducted a 4-week online study, solving and reviewing over 500 problems in total.",
        "[Study Github](https://github.com/PS-ATTACK/PS-ATTACK)"
      ]
    }
  ],
  "skills": {
    "backend": [
      {
        "name": "Java 8, Java 11, Java 17",
        "description": "Deep understanding of OOP principles to implement flexible and scalable architectures. Capable of building robust, testable systems based on TDD."
      },
      {
        "name": "Spring Boot 2.7.x, 3.2.x, Spring MVC, Spring Security, Spring Data JPA (Hibernate), QueryDSL",
        "description": "Understanding and utilizing the core philosophy of Spring. Proficient in implementing authentication/authorization logic via Spring Security."
      },
      {
        "name": "JUnit5, Mockito, Swagger",
        "description": "Proficient in writing TDD-based unit tests using JUnit5 and Mockito."
      }
    ],
    "DevOps": [
      {
        "name": "Ubuntu 18.04"
      },
      {
        "name": "GCP (Compute Engine, Cloud Storage)"
      },
      {
        "name": "GitLab Runner (CI/CD), GitHub Actions"
      },
      {
        "name": "Nginx"
      },
      {
        "name": "PostgreSQL"
      }
    ],
    "Collaboration & Tools": [
      {
        "name": "Slack, Discord"
      },
      {
        "name": "IntelliJ IDEA, VS Code, Vim"
      },
      {
        "name": "Git"
      }
    ],
    "ETC": [
      {
        "name": "C/C++, Typescript, Python/PyTorch"
      }
    ]
  },
  "educations": [
    {
      "name": "Academic Credit Bank System, Bachelor of Computer Engineering",
      "period": "Sep 2025 ~ Feb 2026 (Expected)"
    },
    {
      "name": "Gyeongmin University, Associate of Software (3-year program, Graduated)",
      "period": "Mar 2019 ~ Feb 2024"
    },
    {
      "name": "Engineer Information Processing (Acquired)",
      "period": "Sep 2025 ~ Present"
    }
  ]
}
